Show / Hide Table of Contents
Class IdeaSMemberImportSettings
Represents settings of improt options into Idea Connections
Inheritance
System.Object
IdeaConImportSettings
IdeaSMemberImportSettings
Inherited Members
 IdeaConImportSettings.UseWizard
 IdeaConImportSettings.OrderMembersById
 IdeaConImportSettings.DefaultBoltAssembly
 IdeaConImportSettings.DefaultSteelMaterial
 IdeaConImportSettings.ExportAllLinearCombination
 IdeaConImportSettings.OnePageWizard
 IdeaConImportSettings.ConnectionFileName
 IdeaConImportSettings.WaitForExit
 IdeaConImportSettings.CanChangeDesignCodeInWizard
 IdeaConImportSettings.UserWizardBrand
 IdeaConImportSettings.RunningApplication
 IdeaConImportSettings.DesignCode
 IdeaConImportSettings.DefaultWeldMaterial
 IdeaConImportSettings.StartIdeaStaticaApp
 IdeaConImportSettings.ProjectName
 IdeaConImportSettings.ProjectDescription
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class IdeaSMemberImportSettings : IdeaConImportSettings
Constructors
Improve this Doc   View Source
IdeaSMemberImportSettings()
Constructor - it sets default values
Declaration
public IdeaSMemberImportSettings()
 Improve this Doc
 View Source